# WallUtils Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WallUtils Members
WallUtils Class Methods See Also
---
The WallUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllowWallJoinAtEnd | Allows the wall's end to join to other walls. If that end is near other walls it will become joined as a result. |
| DisallowWallJoinAtEnd | Sets the wall's end not to join to other walls. |
| IsWallJoinAllowedAtEnd | Identifies if the indicated end of the wall allows joins or not. |

# See Also
WallUtils Class
Autodesk.Revit.DB Namespace